var gradeData = [
  {
    "name": "2017级",

    "sub": [
      {
        "name": "信管1701",
      },
      {
        "name": "信管1702",
      },
      {
        "name": "信管1703",
      },
      {
        "name": "信管1704",
      },
      {
        "name": "信管1705",
      },
      {
        "name": "信管1706",
      },
      {
        "name": "信安1701",
      },
      {
        "name": "信安1702",
      },
      {
        "name": "审计1701",
      },
      {
        "name": "商务1701",
      },
      {
        "name": "管科1701",
      }
    ]
  },
  {
    "name": "2016级",

    "sub": [
      {
        "name": "信管1601",
      },
      {
        "name": "信管1602",
      },
      {
        "name": "信管1603",
      },
      {
        "name": "信管1604",
      },
      {
        "name": "信管1605",
      },
      {
        "name": "信管1606",
      },
      {
        "name": "信安1601",
      },
      {
        "name": "信安1602",
      },
      {
        "name": "审计1601",
      },
      {
        "name": "商务1601",
      },
      {
        "name": "管科1601",
      }
    ]
  },
  {
    "name": "2015级",

    "sub": [
      {
        "name": "信管1501",
      },
      {
        "name": "信管1502",
      },
      {
        "name": "信管1503",
      },
      {
        "name": "信管1504",
      },
      {
        "name": "信管1505",
      },
      {
        "name": "信管1506",
      },
      {
        "name": "信安1501",
      },
      {
        "name": "信安1502",
      },
      {
        "name": "审计1501",
      },
      {
        "name": "商务1501",
      },
      {
        "name": "管科1501",
      }
    ]
  },
  {
    "name": "2014级",

    "sub": [
      {
        "name": "信管1401",
      },
      {
        "name": "信管1402",
      },
      {
        "name": "信管1403",
      },
      {
        "name": "信管1404",
      },
      {
        "name": "信管1405",
      },
      {
        "name": "信管1406",
      },
      {
        "name": "信安1401",
      },
      {
        "name": "信安1402",
      },
      {
        "name": "审计1401",
      },
      {
        "name": "商务1401",
      },
      {
        "name": "管科1401",
      }
    ]
  }
  
  
  ];


function init(that) {
  that.setData({
    'gradeData': gradeData,
   
  });
}
module.exports = {
  init: init
}